app/controllers/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "gopika123@yopmail.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "gopika123@yopmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def signup
    user = User.find_by(email: user_params[:email])
    return render json: { error: 'User already registered'}, status: :unprocessable_entity if user.present?

    ActiveRecord::Base.transaction do
      user = User.create!(user_params)

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "gopika123@yopmail.com"], ["LIMIT", 1]]
---
  def login
    user = User.find_by(email: user_params[:email])

INSERT INTO "oauth_access_tokens" ("resource_owner_id", "token", "refresh_token", "expires_in", "scopes", "created_at", "revoked_at", "previous_refresh_token") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def generate_access_token(user)
    access_token = Doorkeeper::AccessToken.create(
      resource_owner_id: user.id,
      expires_in: Doorkeeper.configuration.access_token_expires_in.to_i,
      scopes: 'user',
      use_refresh_token: true
    )