app/controllers/url_controller.rb

INSERT INTO "short_urls" ("url", "code", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?) RETURNING "id"
---
  def short_code
    short_url = @user.short_urls.create!(short_code_params)

SELECT "short_urls".* FROM "short_urls" WHERE "short_urls"."user_id" = ? AND "short_urls"."code" = ? LIMIT ?  [["user_id", 1], ["code", "[FILTERED]"], ["LIMIT", 1]]
---
  def notify
    short_url = @user.short_urls.find_by(code: params[:code])

SELECT "short_urls".* FROM "short_urls" WHERE "short_urls"."code" = ? LIMIT ?  [["code", "[FILTERED]"], ["LIMIT", 1]]
INSERT INTO "clicks" ("count", "short_url_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["count", nil], ["short_url_id", 1], ["created_at", "2026-06-08 08:31:11.894468"], ["updated_at", "2026-06-08 08:31:11.894468"]]
UPDATE "clicks" SET "count" = COALESCE("count", 0) + ? WHERE "clicks"."id" = ?  [["count", 1], ["id", 1]]
---
  def redirect
    short_url = ShortUrl.find_by(code: params[:code])
    return render json: { error: 'URL not found' }, status: :not_found if short_url.nil?

    click = short_url.click || short_url.create_click
    click.increment!(:count)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_user
    @user = User.find_by(id: doorkeeper_token.resource_owner_id) unless doorkeeper_token.blank?