app/models/short_url.rb

  def generate_short_code
    return if code.present?
---
SELECT 1 AS one FROM "short_urls" WHERE "short_urls"."code" = ? LIMIT ?  [["code", "[FILTERED]"], ["LIMIT", 1]]